<!--高复购客户画像-->
<template>
    <div>
        <a-card>
            <div style="font-size: large;">
                高复购客户画像
            </div>
            <el-tabs v-model="activeName" @tab-click="handleClick();finduserImage()">
                <el-tab-pane label="高复购客户单商品时间差" name="second">
                    <el-row :gutter="280">
                        <el-col :span="24">
                            <div class="order-form-searchBar">
                                <el-select
                                        v-model="value1"
                                        filterable
                                        remote
                                        reserve-keyword
                                        placeholder="请输入货品名称关键字"
                                        :remote-method="remoteMethod"
                                        clearable
                                        style="margin-bottom: 15px"
                                >
                                    <el-option
                                            v-for="item in options1"
                                            :key="item.value1"
                                            :label="item.label"
                                            :value="item.value1">
                                    </el-option>
                                </el-select>
                                <a-button type="primary" @click="submitList" style="margin-left:10px;margin-bottom: 15px;">查询</a-button>
                                <el-button type="success" plain style="margin-left: 10px" size="small">导出数据</el-button>
                            </div>
                        </el-col>

                    </el-row>
                </el-tab-pane>
                <div >
                    <el-dialog title="个人画像" :visible.sync="dialogVisible" width="50%" :before-close="handleClose">
                        <el-row>
                            <el-tag >用户网名：{{this.imageRow.buyerNick}}</el-tag>
                            <el-tag >姓名：{{this.imageRow.customerName}}</el-tag>
                            <el-tag >电话：{{this.imageRow.mobile}}</el-tag>
                        </el-row>
                        <el-row>
                            <el-tag >购买货品名称：{{this.imageRow.goodsName}}</el-tag>
                            <el-tag >购买次数：{{this.imageRow.countItem}}</el-tag>
                            <el-tag >单商品购买时间差：{{this.imageRow.timeInterval}}天</el-tag>

                        </el-row>
                        <el-row>
                            <el-tag >上次购买时间：{{this.imageRow.lastPurchaseTime}}</el-tag>
                        </el-row>
                        <div  ref="WordCloud"  :style="{width: '100%', height: '200px'}" :data="worddata"></div>
                        <span slot="footer" class="dialog-footer">
                           <el-button type="primary" @click="dialogVisible = false">返回</el-button>
                           </span>
                    </el-dialog>
                    <el-table :data="tableData" v-loading="loading"
                              element-loading-text="拼命加载中"
                              element-loading-spinner="el-icon-loading"
                              element-loading-background="rgba(255, 255, 255, 0.8)"
                              height="450" border style="..." @row-click="handle"  >
                        <el-table-column  prop="buyerNick" fixed=""    label="客户网名" >
                        </el-table-column>
                        <el-table-column  prop="categoryDimension" label="类别维度" >
                        </el-table-column >
                        <el-table-column  prop="salesDimension" label="销量维度" >
                        </el-table-column >
                        <el-table-column  prop="timeDimension" label="时间维度" >
                        </el-table-column >
                        <el-table-column  prop="valueDimension" label="价值维度" >
                        </el-table-column >
                        <el-table-column  prop="regionalDimension" label="地区维度" >
                        </el-table-column >
                        <el-table-column  prop="platformDimension" label="平台维度" >
                        </el-table-column >
                        <el-table-column  prop="repurchaseDimension" label="复购维度">
                        </el-table-column >
                        <el-table-column  prop="reputationDimension" label="信誉维度" >
                        </el-table-column >
                        <el-table-column  prop="promotionDimension" label="促销维度" >
                        </el-table-column >
                        <el-table-column  prop="cycleDimension" label="周期维度" >
                        </el-table-column >
                        <el-table-column  prop="prop1" label="自定义维度1" >
                        </el-table-column >
                        <el-table-column  prop="prop2" label="自定义维度2" >
                        </el-table-column >
                        <el-table-column  prop="prop3" label="自定义维度3">
                        </el-table-column >
                        <el-table-column  prop="prop4" label="自定义维度4" >
                        </el-table-column >
                        <el-table-column  prop="prop5" label="自定义维度5" >
                        </el-table-column >
                    </el-table>
                    <el-pagination
                            @size-change="handleSizeChange"
                            @current-change="handleCurrentChange"
                            :current-page="queryInfo.pageNum"
                            :page-sizes="[5, 10, 15, 20]"
                            :page-size="queryInfo.pageSize"
                            layout="total, sizes, prev, pager, next, jumper"
                            :total="total">
                    </el-pagination>
                </div>
            </el-tabs>
        </a-card>
        <div>
        </div>
    </div>
</template>
<script>
    import echarts from "echarts";
    import "echarts-wordcloud/dist/echarts-wordcloud";
    import "echarts-wordcloud/dist/echarts-wordcloud.min";

    import StandardTable from '@/components/StandardTable'
    import ARow from "ant-design-vue/es/grid/Row";
    import ACol from "ant-design-vue/es/grid/Col";
    const columns = []
    const dataSource = []
    export default {
        name: "detail",
        components: {ACol, ARow, StandardTable},
        data () {
            return {
                //搜索框框
                options1: [],
                value1: [],
                list: [],
                states:[
                    "甜力能量罐混合245*2罐",
                    "香酥黄花鱼168*5罐",
                    "香辣黄花鱼168*5罐",
                    "820*2罐什锦",
                    "糖水枇杷360*2罐",
                    "彩标草莓425*3罐",
                    "云集新国货312*8罐",
                    "甜力杨枝甘露245*4罐+酸奶245*2罐",
                    "甜力酸奶245*4罐+杨枝甘露245*2罐",
                    "彩标杨梅410*4罐",
                    "甜力酸奶黄桃245*6罐",
                    "甜力杨枝甘露245*6罐",
                    "国货黄桃312g*3罐",
                    "猪肉午餐肉200*12罐",
                    "面膜",
                    "藤椒黄花鱼105*6罐",
                    "香辣黄花鱼105*6罐",
                    "300*12杨枝甘露（三只松鼠）",
                    "300*12酸奶黄桃（三只松鼠）",
                    "蘑菇酱100g*5罐+黄花鱼105g*2罐",
                    "新款清补凉245*6罐",
                    "五香带鱼105g*8罐",
                    "钥匙扣",
                    "猪肉午餐肉200*10罐",
                    "联名清补凉245*8罐",
                    "猪肉午餐肉200*5罐",
                    "草原白蘑菇酱混合口味100*12罐",
                    "黄花鱼荟萃105*18罐",
                    "联名清补凉245*4罐",
                    "藤椒带鱼105*5罐",
                    "香辣带鱼105*5罐",
                    "彩标黄桃425*3罐",
                    "猪肉午餐肉200*2罐",
                    "藤椒带鱼105*3罐",
                    "彩标黄桃425*2罐",
                    "410新彩标杨梅12",
                    "成品-340牛肉午餐肉24",
                    "成品-184香辣黄花鱼20",
                    "成品-185油浸金枪鱼24罐",
                    "340*24猪肉午餐肉",
                    "藤椒带鱼105*6罐",
                    "蘑菇酱混合口味100*6罐",
                    "草原白蘑酱（原味）100*6罐",
                    "草原白蘑酱（香辣)100*6罐",
                    "杨枝甘露312*5罐",
                    "彩标黄桃425*4罐+酸奶黄桃312*2罐",
                    "五香带鱼105*5罐",
                    "尽果柠檬黄桃312*5罐",
                    "火锅午餐肉340*3罐",
                    "油浸金枪鱼185*12罐",
                    "酸奶黄桃312*5罐",
                    "油浸金枪鱼185g*8罐",
                    "黄花鱼带鱼鲱鱼荟萃105g*7罐+100g*3罐",
                    "半成品-鲜360糖水黄桃",
                    "糖水樱桃360g*2罐",
                    "糖水苹果360g*2罐",
                    "水晶椰果360g*2罐",
                    "糖水橘子360g*2罐",
                    "糖水葡萄360g*2罐",
                    "糖水杨梅360g*2罐",
                    "糖水菠萝360g*2罐",
                    "糖水金杏360g*2罐",
                    "糖水草莓360g*2罐",
                    "糖水雪梨360g*2罐",
                    "糖水山楂360g*2罐",
                    "什锦水果360g*2罐",
                    "糖水黄桃360g*2罐",
                    "藤椒带鱼180*6罐",
                    "黄豆牛肉罐头150*6罐",
                    "云集左右双色200g*8罐",
                    "云集耶耶椰果200g*8罐",
                    "云集杨枝甘露312g*4罐装",
                    "云集冰糖什锦200g*6罐",
                    "云集杨枝甘露312g*6罐",
                    "云集新国货糖水黄桃312g*6罐",
                    "云集新国货糖水黄桃312g*5罐装",
                    "云集糖水荔枝360g*2罐",
                    "云集糖水荟萃水果425g*4罐（黄桃椰果什锦雪梨）",
                    "云集糖水黄桃425g*4罐装",
                    "云集柠檬黄桃312g*6罐",
                    "云集冰糖黄桃200g*8罐",
                    "云集荟萃200*6(2黄桃2什锦2椰果)",
                    "藤椒黄花鱼168*6罐",
                    "猪肉午餐肉340*4罐",
                    "藤椒带鱼105*4罐",
                    "寒富士苹果5斤装",
                    "淘气时光冰糖黄桃200*8罐",
                    "三只松鼠杨枝甘露罐头300g*24罐",
                    "三只松鼠酸奶黄桃西米露罐头300*24罐",
                    "三只松鼠热带混合水果罐头200*24罐",
                    "每日好货彩标黄桃425g*6罐",
                    "300g三只松鼠双色水果罐头24罐",
                    "半成品-200耶耶耶果",
                    "水晶椰果238*12罐",
                    "鱼荟萃100*45罐",
                    "彩标黄桃425*8罐",
                    "不用了",
                    "带鱼黄花鱼荟萃105*8罐",
                    "新彩标黄桃200g*6罐",
                    "三味带鱼100g*12罐装",
                    "香酥黄花鱼100*40罐",
                    "香辣黄花鱼100*40罐",
                    "平台专供礼盒好爽什锦425g*6罐",
                    "三联包香酥黄花鱼168*12罐",
                    "三联包什锦360g*12罐",
                    "辣味金枪鱼185*24罐",
                    "麻辣带鱼100*6罐",
                    "五香鱼荟萃105*6罐",
                    "（简装）六小福425g*6罐",
                    "荟萃360*6罐",
                    "香辣带鱼105*6罐",
                    "香辣黄花鱼105*12罐",
                    "荟萃礼盒312*8罐",
                    "香辣带鱼105*12罐",
                    "五香带鱼105*12罐",
                    "黄花鱼荟萃105*3罐（3味）",
                    "杨枝甘露312g*4罐",
                    "彩标桔子425*5罐",
                    "香辣带鱼105*3罐",
                    "带鱼荟萃105*6罐",
                    "三只松鼠冰糖蒸什锦200*24罐",
                    "鱼荟萃100*12罐",
                    "五香带鱼100g*12罐装",
                    "每日好货左右双色200g*4罐",
                    "国货黄桃礼盒312*8罐",
                    "宝贝一直拍荟萃425*6罐",
                    "贝店专供冰糖椰果200*8罐",
                    "彩标黄桃425*5罐+黄花鱼105*1罐",
                    "酸奶黄桃312*6罐",
                    "云集蒸蒸日上礼盒425*6罐",
                    "金杏罐头360g*1罐",
                    "菠萝罐头360g*1罐",
                    "五香带鱼105g*24罐",
                    "香酥黄花鱼105*24罐",
                    "喜鹊新荟萃礼盒425*6罐",
                    "辣味金枪鱼185*3罐",
                    "油浸金枪鱼185*3罐",
                    "黄花鱼荟萃105*16罐",
                    "杨枝甘露312g*6罐",
                    "香酥黄花鱼105*12罐",
                    "香辣带鱼105*9罐",
                    "五香带鱼105*6罐",
                    "带鱼荟萃105g*8罐",
                    "火锅午餐肉340*6罐",
                    "杨枝甘露312g*3罐",
                    "新礼盒荟萃425*6罐（5味）",
                    "五香带鱼105*3罐",
                    "酸奶黄桃312*3罐",
                    "藤椒黄花鱼105*8罐",
                    "寒富士苹果10斤装",
                    "果汁黄桃425g*4罐加柠檬黄桃312g*2",
                    "辣味鱼荟萃105*32罐",
                    "五香鱼荟萃105*32罐",
                    "鱼荟萃105*32罐",
                    "五香带鱼105*9罐",
                    "五香鱼荟萃105*9罐",
                    "鱼荟萃105*9罐",
                    "香酥黄花鱼105*9罐",
                    "黄花鱼带鱼荟萃105*6罐",
                    "鱼荟萃105*4罐",
                    "罐头大组合",
                    "罐头小组合",
                    "水果组合1792g",
                    "每日一淘肉类组合790g",
                    "年年有余礼盒168*6",
                    "香酥黄花鱼105*8罐",
                    "香辣黄花鱼105*8罐",
                    "黄花鱼荟萃105*8罐",
                    "半成品-鲜品300g双色杂果",
                    "每日一淘火锅午餐肉340*4罐",
                    "半成品-312酸奶黄桃冻",
                    "半成品-312杨枝甘露",
                    "天猫果汁黄桃425g*5罐加赠品",
                    "香酥黄花鱼105*6罐",
                    "酸奶黄桃312*5+200冰糖黄桃1",
                    "新国货黄桃312*5罐+200g耶耶耶果1罐",
                    "酸奶黄桃312*2罐",
                    "新国货糖水黄桃312*2罐",
                    "新国货糖水黄桃312*6罐",
                    "香酥香辣黄花鱼罐头105*2罐",
                    "香酥黄花鱼罐头105*1罐",
                    "贝店专供猪肉午餐肉200*6罐",
                    "云集酸奶黄桃312*5罐",
                    "未来集市深海鱼罐头礼盒装168g*6罐",
                    "未来集市水果罐头礼盒装425g*8罐",
                    "未来集市油浸金枪鱼罐头185g*4罐",
                    "未来集市清补凉椰奶谷物245g*6罐",
                    "未来集市经典水果罐头组合多种口味350g*6罐",
                    "未来集市黄花鱼罐头多味组合105g*4罐",
                    "未来集市猪肉午餐肉罐头200g*3罐",
                    "未来集市柠檬黄桃罐头312g*4罐",
                    "未来集市冰糖水果罐头多种水果组合200g*6罐",
                    "未来集市水果罐头多种水果组合425g*6罐",
                    "未来集市糖水黄桃罐头312g*5罐",
                    "未来集市酸奶黄桃罐头312g*4罐",
                    "未来集市耶耶椰果罐头200g*4罐",
                    "未来集市冰糖什锦罐头200g*4罐",
                    "未来集市冰糖黄桃罐头200g*4罐",
                    "未来集市果汁黄桃罐头425g*4罐",
                    "贝店专供黄花鱼荟萃105*8罐",
                    "黄豆牛肉罐头150*4罐",
                    "杏鲍菇猪肉罐头150*4罐",
                    "林家铺子对开黄桃水果罐头玻璃罐910*2罐",
                    "黄花鱼荟萃罐头105*12罐",
                    "贝店黄豆牛肉罐头150*4罐",
                    "贝店杏鲍菇猪肉罐头150*4罐",
                    "每日一淘水果荟萃425*4罐",
                    "每日一淘黄花鱼荟萃168*6罐",
                    "每日一淘酸奶黄桃312*6罐",
                    "每日一淘鱼荟萃100*4罐",
                    "苹果罐头360g*1罐",
                    "黄花鱼荟萃105*10罐",
                    "每日一淘黄豆牛肉罐头",
                    "每日一淘杏鲍菇猪肉罐头",
                    "黄桃罐头200g*2罐+耶耶椰果200g*2罐",
                    "成品-238精品荟萃8",
                    "耶耶椰果200*4罐装",
                    "成品-238精品荟萃12",
                    "糖水黄桃415*1罐",
                    "成品-100香辣鲅鱼30",
                    "340猪肉午餐肉4",
                    "双色椰果荟萃200*6罐",
                    "双色椰果荟萃200*8罐",
                    "贝店专供黄花鱼荟萃105*9罐",
                    "贝店冰糖黄桃200*6罐",
                    "糖水荔枝360g*2罐",
                    "猪肉午餐肉200*8罐",
                    "每日一淘新彩标糖水椰果罐头425g*4罐",
                    "每日一淘新彩标糖水雪梨罐头425g*4罐",
                    "每日一淘新彩标糖水什锦罐头425g*4罐",
                    "每日一淘新彩标糖水草莓罐头425g*4罐",
                    "每日一淘油浸金枪鱼罐头185g*4罐",
                    "每日一淘香辣鲱鱼100g*6罐",
                    "每日一淘香辣鲱鱼100g*2罐",
                    "每日一淘辣味金枪鱼185g*6罐",
                    "贝店果汁黄桃425*3罐",
                    "贝店专供425彩标桔子",
                    "贝店桃颜甄选燕窝礼盒",
                    "云集混合水果罐头425*6罐",
                    "一淘定制黄桃425g*4罐",
                    "贝店猪肉午餐肉罐头200*3罐",
                    "黄花鱼荟萃105*6罐",
                    "贝店好吃懒做礼盒",
                    "商标-100香辣黄花鱼",
                    "贝店专供酸奶黄桃312*5罐",
                    "彩标糖水椰果425*5罐",
                    "贝店黄花鱼荟萃105*4罐",
                    "每日一淘黄花鱼荟萃105*4罐",
                    "贝店专供果汁黄桃425g*5+酸奶黄桃312g*1罐",
                    "耶耶椰果200g*8罐",
                    "耶耶椰果200g*6罐",
                    "云集糖水黄桃罐头425*5罐",
                    "云集椰奶清补凉245*6罐",
                    "云集酸奶黄桃罐头312*4罐",
                    "猪肉午餐肉200*9罐",
                    "黄花鱼荟萃105*9",
                    "425马口铁罐瓶盖",
                    "火腿午餐肉罐头200g*3罐",
                    "猪肉午餐肉200g*3罐",
                    "贝店冰糖黄桃200*4*2罐",
                    "豆豉黄花鱼100*8罐",
                    "新彩标什锦425*5罐",
                    "樱桃罐头360g*1罐",
                    "雪梨罐头360g*1罐",
                    "什锦罐头360g*1罐",
                    "山楂罐头360g*1罐",
                    "椰果罐头360g*1罐",
                    "葡萄罐头360g*1罐",
                    "桔子罐头360g*1罐",
                    "左右双色罐头200g*8罐",
                    "左右双色200g*3罐",
                    "黄桃罐头360g*1罐",
                    "草莓罐头360g*1罐",
                    "杨梅罐头360g*1罐",
                    "荔枝罐头360g*1罐",
                    "果汁黄桃425*1罐",
                    "新国货黄桃罐头312g*5罐（赠一罐200g椰果/什锦）",
                    "半成品-100香辣黄花鱼",
                    "商标-100香酥黄花鱼",
                    "半成品-105藤椒黄花鱼",
                    "半成品-100香酥黄花鱼",
                    "半成品-105香酥黄花鱼",
                    "平台专供红烧猪肉340*12",
                    "五香鲅鱼100*9",
                    "糖水桔子425*24",
                    "猪肉午餐肉200*6罐",
                    "猪肉午餐肉200*4罐",
                    "三只松鼠柠檬黄桃312*24",
                    "山楂菠萝组合425*24罐",
                    "黄花鱼荟萃105*4罐",
                    "普通发票",
                    "贝店专供彩标荟萃425*6罐",
                    "每日一淘彩标黄桃425*6罐",
                    "每日一淘左右双色水果200*4罐",
                    "每日一淘冰糖椰果200*4",
                    "每日一淘牛肉午餐肉340*2罐",
                    "每日一淘猪肉午餐肉340*2罐",
                    "每日一淘彩标杨梅410*5罐",
                    "每日一淘冰糖什锦200*6罐",
                    "每日一淘冰糖山楂200*6罐",
                    "每日一淘红烧牛肉100*6罐",
                    "每日一淘豆豉黄花鱼184*6罐",
                    "每日一淘香辣黄花鱼184*6罐",
                    "每日一淘冰糖什锦200*8罐",
                    "每日一淘彩标荟萃425*6罐",
                    "香酥黄花鱼105*4罐",
                    "藤椒黄花鱼105*4罐",
                    "香辣黄花鱼105*4罐",
                    "每日一淘冰糖什锦200*4罐",
                    "贝店专供柠檬黄桃200*2罐",
                    "冰糖黄桃200*8罐",
                    "香辣带鱼100*32罐",
                    "香辣鲅鱼100*32罐",
                    "五香鲅鱼100*32罐",
                    "每日一淘带鱼荟萃100*9罐",
                    "每日一淘红烧猪肉340*6罐",
                    "每日一淘香辣牛肉100*6罐",
                    "达令家彩标黄桃425*6罐",
                    "精品荟萃425*12罐",
                    "每日一淘柠檬黄桃312*4",
                    "每日一淘猪肉午餐肉340*6罐",
                    "贝店专供清补凉245*6罐",
                    "达令家彩标荟萃425*6罐",
                    "贝店专供新国货糖水黄桃312*5罐",
                    "新国货糖水黄桃312*5罐",
                    "每日一淘猪肉午餐肉200*9罐",
                    "每日一淘猪肉午餐肉200*4罐",
                    "每日一淘冰糖雪梨200*6罐",
                    "冰糖什锦罐头200g*2",
                    "香辣黄花鱼100g9罐装",
                    "香辣鲅鱼100*12罐",
                    "100五香带鱼32",
                    "平台专供礼盒长寿黄桃425g6罐",
                    "245清补凉12",
                    "312柠檬黄桃5",
                    "200柠檬黄桃4",
                    "200柠檬黄桃30",
                    "美宜达-425精品荟萃8",
                    "425进口菠萝24",
                    "200荟萃2",
                    "果汁黄桃425*8罐",
                    "425果汁草莓8",
                    "180分享大礼包",
                    "168分享大礼包",
                    "豆豉黄花鱼100g9罐装",
                    "彩标雪梨425*4罐",
                    "425g新彩标山楂5",
                    "彩标山楂425*4罐",
                    "200冰糖蒸椰果24罐",
                    "200冰糖黄桃3",
                    "200冰糖黄桃24",
                    "200冰糖草莓4",
                    "冰糖椰果200*3罐",
                    "冰糖什锦200*24",
                    "彩标草莓425*4罐",
                    "每日一淘彩标黄桃425*5罐",
                    "每日一淘糖水荔枝360*6罐",
                    "每日一淘冰糖荟萃200*6罐",
                    "每日一淘冰糖椰果200*6罐",
                    "每日一淘冰糖黄桃200*4罐2箱装",
                    "每日一淘黄花鱼荟萃100*6罐2箱装",
                    "每日一淘鱼荟萃100*8罐",
                    "每日一淘黄花鱼荟萃100*6罐",
                    "每日一淘黄花鱼荟萃100*9罐",
                    "彩标什锦425*4罐",
                    "彩标椰果425*4罐",
                    "彩标菠萝425*4罐",
                    "每日好货彩标荟萃425*6罐",
                    "一淘冰糖荟萃200*6两箱装",
                    "柠檬黄桃312*2罐",
                    "彩标雪梨425*4罐",
                    "彩标桔子425*4罐",
                    "彩标草莓425*4罐",
                    "彩标山楂425*4罐",
                    "贝店专供酸奶黄桃312*4罐",
                    "酸奶黄桃312*4罐",
                    "每日一淘酸奶黄桃312*4罐",
                    "冰糖荟萃黄桃椰果200*4罐",
                    "168香酥黄花鱼",
                    "香酥黄花鱼100*9罐",
                    "雪梅干",
                    "180香辣鲐鲅鱼",
                    "香辣牛肉100g8罐装",
                    "168香辣黄花鱼",
                    "180香辣带鱼",
                    "180五香鲐鲅鱼",
                    "180五香带鱼",
                    "五香带鱼",
                    "425糖水椰果12",
                    "360糖水山楂",
                    "礼盒水晶葡萄425g8罐",
                    "360糖水葡萄",
                    "360糖水枇杷",
                    "360糖水苹果",
                    "360糖水荔枝",
                    "360糖水桔子",
                    "360糖水黄桃",
                    "360糖水草莓",
                    "彩标菠萝425*6罐",
                    "360糖水菠萝",
                    "热带荟萃425g6罐",
                    "360水晶椰果",
                    "360什锦水果",
                    "牛肉午餐肉牛肉罐头*12（牛肉12个的）",
                    "每日一淘彩标山楂425*5罐",
                    "每日一淘糖水菠萝425*5罐",
                    "每日一淘清补凉260*6罐",
                    "每日一淘冰糖黄桃200*4罐",
                    "246鸿运七喜礼盒装",
                    "200火腿午餐肉36",
                    "半成品-3000黄桃丁",
                    "360荟萃礼盒6",
                    "八福果罐头425*8罐",
                    "360荟萃12",
                    "425果汁椰果",
                    "425果汁什锦6",
                    "425果汁梨",
                    "425果汁黄桃12",
                    "425果汁荟萃8",
                    "425果汁草莓6",
                    "100豆豉黄花鱼4",
                    "425冰糖葡萄8",
                    "果汁黄桃425*2罐",
                    "果汁山楂425*6罐",
                    "彩标黄桃425*4罐",
                    "彩标荟萃425*6罐",
                    "香辣鲱鱼100*4香辣带鱼100*4香酥黄花鱼100*4",
                    "冰糖草莓200g*6罐",
                    "冰糖雪梨200g*6罐",
                    "贝店专供冰糖什锦200*4罐",
                    "冰糖什锦200*8罐",
                    "五香带鱼香酥黄花鱼荟萃168*6罐",
                    "五香带鱼鲅鱼黄花鱼荟萃100*9罐",
                    "黄花鱼带鱼荟萃100*9罐",
                    "黄花鱼带鱼荟萃100*12罐",
                    "冰糖蒸黄桃山楂425g*6罐",
                    "冰糖蒸山楂425g*4罐",
                    "冰糖蒸雪梨425g*4罐",
                    "冰糖蒸桔子425g*4罐",
                    "冰糖蒸草莓425g*4罐",
                    "冰糖蒸黄桃425g*4罐",
                    "冰糖蒸荟萃425g*4罐",
                    "冰糖蒸椰果425g*4罐",
                    "冰糖蒸什锦425g*4罐",
                    "冰糖蒸荟萃425g*8罐礼盒",
                    "冰糖蒸椰果425g*8罐礼盒",
                    "冰糖蒸什锦425g*8罐礼盒",
                    "黄花鱼荟萃100*12罐",
                    "火腿午餐肉200*4",
                    "冰糖黄桃200*3罐",
                    "冰糖黄桃200*1罐",
                    "香酥黄花鱼100*1罐",
                    "彩标杨梅425*5罐加彩标黄桃425*1罐",
                    "冰糖黄桃200*2罐",
                    "香辣黄花鱼100*2罐",
                    "五香带鱼100*5罐",
                    "果汁黄桃425*4罐",
                    "贝店专供彩标黄桃425*6罐",
                    "美宜达糖水杨梅350*6",
                    "美宜达水晶椰果350*6",
                    "美宜达香酥黄花鱼168*6罐",
                    "美宜达香辣鲐鲅鱼180*6罐",
                    "美宜达香辣黄花鱼168*6罐",
                    "美宜达香辣带鱼180*6罐",
                    "美宜达糖水山楂350*6罐",
                    "美宜达什锦水果360*6罐",
                    "美宜达糖水黄桃360*6",
                    "美宜达糖水草莓360*6罐",
                    "香酥黄花鱼100*8罐",
                    "香辣黄花鱼100*8罐",
                    "香辣带鱼100*9罐",
                    "五香带鱼100*9罐",
                    "香辣带鱼100*12罐",
                    "香酥黄花鱼100*12罐",
                    "果汁草莓罐头425g*4罐",
                    "辣味金枪鱼185*4罐",
                    "烘焙黄桃丁3KG*1罐",
                    "冰糖蒸桔子罐头425g*8罐",
                    "冰糖蒸山楂罐头425g*8罐",
                    "冰糖蒸黄桃罐头425*8罐",
                    "冰糖蒸雪梨罐头425g*8罐",
                    "冰糖蒸草莓罐头425g*8罐",
                    "每日一淘彩标黄桃425*4罐",
                    "果汁黄桃425*6罐",
                    "糖水草莓罐头425g*12",
                    "糖水雪梨罐头425g*12",
                    "糖水桔子罐头425g*12",
                    "糖水山楂罐头425g*12",
                    "糖水黄桃罐头425g*12",
                    "糖水菠萝罐头425g*12",
                    "糖水什锦罐头425g*12",
                    "鱼罐头100gX32罐量贩装4种口味",
                    "果汁桔子罐头425g*6罐",
                    "彩标菠萝425*8罐礼盒",
                    "贝店专供果汁黄桃425*4罐",
                    "一淘专供糖水黄桃425*6罐2箱",
                    "带鱼荟萃100*12罐",
                    "捕手彩标黄桃425*5罐",
                    "糖水黄桃312*4罐",
                    "带鱼荟萃100*30罐",
                    "彩标杨梅410*6罐",
                    "桃颜甄选",
                    "冰糖山楂200*6罐",
                    "拼多多5罐荟萃",
                    "不用了",
                    "鱼荟萃100*8罐",
                    "贝店专供猪肉午餐肉340*6罐",
                    "贝店专供酸奶黄桃312*6罐",
                    "贝店专供牛肉午餐肉340*2罐",
                    "贝店专供猪肉午餐肉340*2罐",
                    "贝店专供红烧牛肉100*6罐",
                    "贝店专供彩标杨梅410*5罐",
                    "彩标杨梅410*8罐礼盒",
                    "彩标杨梅410*5罐",
                    "贝店专供采标雪梨425*6罐",
                    "180g香辣带鱼6",
                    "糖水黄桃360*6罐",
                    "带鱼荟萃100*9罐",
                    "豆豉黄花鱼184*6罐",
                    "冰糖什锦200*4罐",
                    "贝店专供彩标/果汁黄桃425*6罐",
                    "清补凉245*6罐",
                    "鱼荟萃168*6罐礼盒",
                    "好吃懒做礼盒",
                    "礼盒彩标荟萃425*6罐",
                    "猪肉午餐肉340*6罐",
                    "猪肉午餐肉340*2罐",
                    "牛肉午餐肉340*6罐",
                    "牛肉午餐肉340*4罐",
                    "牛肉午餐肉340*2罐",
                    "牛肉午餐肉340*1罐",
                    "火腿午餐肉200*6罐",
                    "贝店专供牛肉午餐肉340*6罐",
                    "香辣牛肉100*6罐",
                    "贝店专供香辣牛肉100*6罐",
                    "红烧牛肉100*6罐",
                    "红烧猪肉340*6罐",
                    "红烧猪肉340*4罐",
                    "红烧猪肉340*1罐",
                    "贝店专供红烧猪肉340*6罐",
                    "香辣鲱鱼100*6罐",
                    "香辣鲱鱼100*2罐",
                    "6味鱼荟萃168*6罐",
                    "鱼荟萃100*6罐",
                    "鱼荟萃100*4罐",
                    "贝店专供鱼荟萃100*4罐",
                    "贝店专供鱼荟萃168*6罐礼盒",
                    "油浸金枪鱼185*6罐",
                    "油浸金枪鱼185*4罐",
                    "辣味金枪鱼185*6罐",
                    "贝店专供油浸金枪鱼185*4罐",
                    "贝店专供辣味金枪鱼185*6罐",
                    "茄汁沙丁鱼397*6罐",
                    "茄汁鲭鱼397*6罐",
                    "五香带鱼180*6罐",
                    "带鱼荟萃100*6罐",
                    "贝店专供五香带鱼180*6罐",
                    "五香鲅鱼180*6罐",
                    "香酥黄花鱼168*6罐",
                    "香辣黄花鱼184*6罐",
                    "香辣黄花鱼168*6罐",
                    "香辣黄花鱼100*4罐",
                    "黄花鱼荟萃100*9罐",
                    "黄花鱼荟萃100*6罐",
                    "豆豉黄花鱼184*4罐",
                    "贝店专供香酥黄花鱼168*6罐",
                    "贝店专供香辣黄花鱼184*6罐",
                    "贝店专供香辣黄花鱼100*4罐",
                    "贝店专供豆豉黄花鱼184*6罐",
                    "贝店专供豆豉黄花鱼100*4罐",
                    "糖水杨梅360*6罐",
                    "贝店专供糖水杨梅360*6罐",
                    "糖水枇杷360*6罐",
                    "贝店专供糖水枇杷360*6罐",
                    "360荟萃6罐礼盒",
                    "糖水南荟萃360*6罐",
                    "每日一淘彩标荟萃425*6罐",
                    "彩标荟萃425*4",
                    "冰糖荟萃200*6罐",
                    "果汁荟萃425*6罐",
                    "彩标八福果425*8罐礼盒",
                    "糖水北荟萃360*6罐",
                    "贝店专供果汁荟萃425*6罐",
                    "贝店专供荟萃360*6罐礼盒",
                    "贝店专供北荟萃360*6罐",
                    "贝店专供彩标八福果425*8罐礼盒",
                    "糖水葡萄360*6罐",
                    "糖水荔枝360*6罐",
                    "贝店专供糖水荔枝360*6罐",
                    "糖水金杏360*6罐",
                    "糖水樱桃360*6罐",
                    "糖水菠萝360*6罐",
                    "进口菠萝425*5罐",
                    "进口菠萝425*6罐",
                    "贝店专供进口菠萝425*6罐",
                    "糖水椰果360*6罐",
                    "彩标椰果425*8罐礼盒",
                    "彩标椰果425*6罐",
                    "冰糖椰果200*6罐",
                    "冰糖椰果200*4罐",
                    "贝店专供彩标椰果425*6罐",
                    "彩标山楂425*8罐礼盒",
                    "彩标山楂425*5罐",
                    "糖水山楂360*6罐",
                    "彩标山楂425*6罐",
                    "冰糖山楂200*4罐",
                    "贝店专供彩标山楂425*6罐",
                    "彩标雪梨425*8罐礼盒",
                    "糖水雪梨360*6罐",
                    "彩标雪梨425*6罐",
                    "冰糖雪梨200*4罐",
                    "糖水苹果360*6罐",
                    "彩标桔子425*8罐礼盒",
                    "糖水桔子360*6罐",
                    "彩标桔子425*6罐",
                    "贝店专供彩标桔子425*6罐",
                    "彩标草莓425*8罐礼盒",
                    "糖水草莓360*6罐",
                    "彩标草莓425*6罐",
                    "贝店专供彩标草莓425*6罐",
                    "左右双色水果200*4罐",
                    "彩标什锦425*8罐礼盒",
                    "糖水什锦360*6罐",
                    "彩标什锦425*6罐",
                    "冰糖什锦200*6罐",
                    "贝店专供彩标什锦425*6罐",
                    "彩标黄桃425*8罐礼盒",
                    "糖水黄桃312*6罐",
                    "果汁黄桃425*5罐",
                    "柠檬黄桃312*8罐礼盒",
                    "柠檬黄桃312*6罐",
                    "柠檬黄桃312*4罐",
                    "每日一淘柠檬黄桃312*6罐",
                    "定制绿标黄桃425*6罐",
                    "每日一淘冰糖黄桃200*6罐",
                    "捕手柠檬黄桃312*3罐",
                    "【阁楼上的猫】黄桃罐头425g*5罐",
                    "寿桃1350*2罐礼盒",
                    "彩标黄桃425*6罐",
                    "彩标黄桃425*5罐",
                    "冰糖黄桃200*6罐",
                    "冰糖黄桃200*4罐",
                    "贝店专供果汁黄桃425*5罐",
                    "贝店专供柠檬黄桃312*4罐",
                    "贝店专供黄桃360*6罐",
                    "贝店专供冰糖荟萃200*6罐",
                    "贝店专供冰糖黄桃200*4罐",
                    "即食燕窝75*4罐礼盒",
                    "香辣鲅鱼180*6罐"
                ],
                value2:{
                    goodsName:''
                },
                //分页
                queryInfo:{
                    pageNum:1,
                    pageSize:10,
                },
                customStyle:'background:white;border-radius: 2px;margin-bottom: 2px;border: 0;overflow: hidden',
                //自定义标签解决
                optionLabel5:[
                    {
                        value: '选项1',
                        label: ''
                    },
                ],
                optionLabel4:[
                    {
                        value: '选项1',
                        label: ''
                    },
                ],
                optionLabel3:[
                    {
                        value: '选项1',
                        label: ''
                    },
                ],
                optionLabel2:[
                    {
                        value: '选项1',
                        label: ''
                    },
                ],
                optionLabel:[
                    {
                        value: '选项1',
                        label: ''
                    },
                ],
                value:'',
                //选择器
                selectData:[],
                cannot1:true,
                cannot2:true,
                cannot3:true,
                cannot4:true,
                cannot5:true,
                //自定义按钮
                dis0:true,
                dis1:true,
                dis2:true,
                dis3:true,
                dis4:true,
                //省份选择
                options: [{
                    value: '河北省',
                    label: '河北省'
                }, {
                    value: '山西省',
                    label: '山西省'
                }, {
                    value: '辽宁省',
                    label: '辽宁省'
                }, {
                    value: '吉林省',
                    label: '吉林省'
                }, {
                    value: '黑龙江省',
                    label: '黑龙江省'
                },{
                    value: '江苏省',
                    label: '江苏省'
                },{
                    value: '浙江省',
                    label: '浙江省'
                },{
                    value: '安徽省',
                    label: '安徽省'
                },{
                    value: '福建省',
                    label: '福建省'
                },{
                    value: '江西省',
                    label: '江西省'
                },{
                    value: '山东省',
                    label: '山东省'
                },{
                    value: '河南省',
                    label: '河南省'
                },{
                    value: '湖北省',
                    label: '湖北省'
                },{
                    value: '湖南省',
                    label: '湖南省'
                },{
                    value: '广东省',
                    label: '广东省'
                },{
                    value: '海南省',
                    label: '海南省'
                },{
                    value: '四川省',
                    label: '四川省'
                },{
                    value: '贵州省',
                    label: '贵州省'
                },{
                    value: '云南省',
                    label: '云南省'
                },{
                    value: '陕西省',
                    label: '陕西省'
                },{
                    value: '甘肃省',
                    label: '甘肃省'
                },{
                    value: '青海省',
                    label: '青海省'
                },{
                    value: '台湾',
                    label: '台湾'
                },{
                    value: '内蒙古自治区',
                    label: '内蒙古自治区'
                },{
                    value: '广西壮族自治区',
                    label: '广西壮族自治区'
                },{
                    value: '西藏自治区',
                    label: '西藏自治区'
                },{
                    value: '宁夏回族自治区',
                    label: '宁夏回族自治区'
                },{
                    value: '新疆维吾尔自治区',
                    label: '新疆维吾尔自治区'
                },{
                    value: '北京市',
                    label: '北京市'
                },{
                    value: '天津市',
                    label: '天津市'
                },{
                    value: '上海市',
                    label: '上海市'
                },{
                    value: '重庆市',
                    label: '重庆市'
                },{
                    value: '香港特别行政区',
                    label: '香港特别行政区'
                },{
                    value: '澳门特别行政区',
                    label: '澳门特别行政区'
                }],
                //每行数据
                imageRow:[],
                //个人画像弹框
                dialogVisible: false,
                //表格加载
                loading: true,
                advanced: true,
                tableData:[],
                selectedRows: [],
                pageSize: '',
                total: 0,
                tokenStr:'',
                activeName: 'second',
                // 复选框
                checked: true,
                indeterminate: true,
                //词云
                worddata: [
                    {
                        name: "中国特色社会主义",
                        value: 8500
                    },
                    {
                        name: "两学一做",
                        value: 7008
                    },{
                        name: "中华民族",
                        value: 9386
                    },
                    {
                        name: "马克思主义",
                        value: 6500
                    },
                    {
                        name: "民族复兴",
                        value: 8900
                    },
                    {
                        name: "社会主义制度",
                        value: 9500
                    },
                    {
                        name: "国防白皮书",
                        value:8000
                    },
                    {
                        name: "创新",
                        value: 8800
                    },
                    {
                        name: "民主革命",
                        value: 7850
                    },
                    {
                        name: "文化强国",
                        value: 9380
                    },{
                        name: "民主革命",
                        value: 9850
                    },{
                        name: "民主革命",
                        value: 8850
                    },{
                        name: "民主革命",
                        value: 7850
                    },{
                        name: "民主革命",
                        value: 8850
                    },{
                        name: "民主革命",
                        value: 7850
                    },{
                        name: "民主革命",
                        value: 9850
                    },{
                        name: "民主革命",
                        value: 7850
                    },{
                        name: "民主革命",
                        value: 8850
                    },
                ],
                flag: 0,
                //词云图片
                //标签搜索
                formInline:{
                    categoryDimension:'',
                    timeDimension:'',
                    salesDimension:'',
                    valueDimension:'',
                    regionalDimension:'',
                    platformDimension:'',
                    repurchaseDimension:'',
                    reputationDimension:'',
                    promotionDimension:'',
                    cycleDimension:'',
                    prop1:'',
                    prop2:'',
                    prop3:'',
                    prop4:'',
                    prop5:'',
                },
                //条件查询
                form:{
                    reStartTime:'',
                    reEndTime:'',
                    // payStartTime:'',
                    // payEndTime:'',
                    totalPurchaseAmountLow:'',
                    totalPurchaseAmountHigh:'',
                    province:'',
                    totalPurchaseNumLow:'',
                    totalPurchaseNumHigh:'',
                    lastStartTime:'',
                    lastEndTime:'',
                }
            }
        },
        authorize: {
            deleteRecord: 'delete'
        },
        created() {
            this.loading=true
            const that = this
            const tokenStr = window.sessionStorage.getItem('token')
            // console.log(tokenStr)
            axios.get('backend/portrait/customerPortrait/findAllCusPortraitHi/1/10', {headers:{
                    token: tokenStr
                }}).then(res => {
                this.loading=false
                // console.log(res.data.data)
                // console.log("看看数据")
                that.tableData = res.data.data.list
                that.total=res.data.data.total
            }).catch()
        },
        mounted(){
            this.initChart();
            // this.getuserImage();
            this.getLabelVal();
            // this.getGoods();
            this.list = this.states.map(item => {
                return { value1: `${item}`, label: `${item}` };

            });
        },
        methods: {
            submitList(){
                const vm = this;
                this.loading=true
                const that = this
                const list = this.value1
                console.log(that.value1)
                const tokenStr = window.sessionStorage.getItem('token')
                if(that.flag===0){
                    axios.get('http://localhost:8080/backend/portrait/customerPortrait/findHiPurchaseItemAvgTI/1/10', {
                        params: {
                            goodsName: that.value1,
                        },
                        headers: {token: tokenStr},
                        tokenBackend: tokenStr
                    }).then( res => {
                        console.log(res.data)
                        that.tableData = res.data.data.list;
                        that.total=res.data.data.total;
                        this.loading=false
                        this.flag=1
                        if(res.data.data.list == null) {
                            this.$message.error('未查询到相关用户！')
                        }else{
                            // console.log("成功！！")
                            //遇到失效问题，解决
                            vm.$message({
                                showClose: true,
                                message: '查询成功',
                                type: 'success'
                            });
                        }
                    }).catch()
                }
                else if(this.flag===1){
                    axios.get('http://localhost:8080/backend/portrait/customerPortrait/findHiPurchaseItemAvgTI/'+
                        this.queryInfo.pageNum+'/'+this.queryInfo.pageSize, {
                        params: {
                            goodsName: that.value1,
                        },
                        headers: {token:tokenStr},
                        tokenBackend: tokenStr
                    }).then( res => {
                        // console.log(res.data)
                        that.tableData = res.data.data.list;
                        that.total=res.data.data.total;
                        this.loading=false
                    }).catch()
                }
            },
            //搜索框
            remoteMethod(query) {
                if (query !== '') {
                    setTimeout(() => {
                        this.options1 = this.list.filter(item => {
                            return item.label.toLowerCase()
                                .indexOf(query.toLowerCase()) > -1;
                        });
                    }, 200);
                } else {
                    this.options1 = [];
                }
            },
            //分页数据展示
            finduserImage(){
                this.loading=true
                const that = this
                const tokenStr = window.sessionStorage.getItem('token')
                axios.get('backend/portrait/customerPortrait/findAllCusPortraitHi/1/10', {headers:{
                        token: tokenStr
                    }}).then(res => {
                    this.loading=false
                    // console.log(res.data.data)
                    // console.log("看看数据")
                    that.tableData = res.data.data.list
                    that.total=res.data.data.total
                }).catch()

            },
            //s获取标签
            getLabelVal(){
                const that = this
                // console.log("画像页调取页面更新自定义标签")
                const tokenStr = window.sessionStorage.getItem('token')
                axios.get('backend/label/findAllLabelVal/1/5',{headers:{
                        token: tokenStr}}).then(res => {
                    // console.log(res.data)
                    that.selectData = res.data.data.list;
                    // that.getTotal()
                    if (that.selectData[0].labelDimension === '自定义维度1') {
                        that.dis0 = false
                        this.cannot1=false
                        this.optionLabel[0].label= that.selectData[0].labelVal
                        // this.optionLabel[0].value=res.data.data.list[0].labelVal
                        // console.log(res.data.data.list[0].labelVal)
                        // console.log('标签1')
                    } else if (that.selectData[0].labelDimension === '自定义维度2') {
                        that.dis1 = false;
                        this.cannot2=false
                        this.optionLabel2[0].label=that.selectData[0].labelVal
                        // console.log('已定义2')
                    } else if (that.selectData[0].labelDimension === '自定义维度3') {
                        that.dis2 = false;
                        this.cannot3=false
                        this.optionLabel3[0].label=that.selectData[0].labelVal
                        // console.log('已定义3')
                    } else if (that.selectData[0].labelDimension === '自定义维度4') {
                        that.dis3 = false;
                        this.cannot4=false
                        this.optionLabel4[0].label=that.selectData[0].labelVal
                        // console.log('已定义4')
                    } else if (that.selectData[0].labelDimension === '自定义维度5') {
                        that.dis4 = false;
                        this.cannot5=false
                        this.optionLabel5[0].label=that.selectData[0].labelVal
                        // console.log('已定义5')
                    }
                }).catch()
            },
            // 分页ok,首页是0，标签是1，条件是2
            handleCurrentChange(currentPage){
                // console.log(currentPage)
                this.loading=true
                this.queryInfo.pageNum = currentPage
                const tokenStr = window.sessionStorage.getItem('token')
                const that = this
                if(this.flag===0){
                    axios.get('backend/portrait/customerPortrait/findAllCusPortraitHi/'+currentPage+'/'
                        +this.queryInfo.pageSize, {headers:{
                            token: tokenStr
                        }}).then(res => {
                        // console.log(res.data.data)
                        that.tableData = res.data.data.list
                        that.total=res.data.data.total
                        this.loading=false
                        // console.log("总接口当前页码")
                    }).catch()
                }  else if(this.flag===1){
                    this.submitList()
                }
            },
            handleSizeChange(pageSize) {
                // console.log("页面数据量")
                // console.log(pageSize)
                this.queryInfo.pageSize = pageSize;
                const that = this
                const tokenStr = window.sessionStorage.getItem('token')
                if(this.flag===0){
                    axios.get('backend/portrait/customerPortrait/findAllCusPortraitHi/'
                        +this.queryInfo.pageNum+'/'+pageSize, {headers:{
                            token: tokenStr
                        }}).then(res => {
                        // // console.log(res.data.data)
                        that.tableData = res.data.data.list
                        that.total=res.data.data.total
                        // console.log("总接口页面数据")
                    }).catch()
                }else if(this.flag===1){
                    this.submitList()
                }
            },

            checkAll(){
            },
            // 展开
            toggleAdvanced () {
                this.advanced = !this.advanced
            },
            onChange(checkedList) {
                this.indeterminate = !!checkedList.length && checkedList.length < plainOptions.length;
                this.checkAll = checkedList.length === plainOptions.length;
            },
            //时间选择框
            startChange(date,dateString){
                this.form.reStartTime =dateString
                // console.log(dateString)
            },
            stopChange(date,dateString){
                this.form.reEndTime = dateString
                // console.log(dateString)
            },
            lastStartChange(date,dateString){
                this.form.lastStartTime = dateString
            },
            lastStopChange(date,dateString){
                this.form.lastEndTime = dateString
            },
            //词云
            initChart() {
                const WordCloud  = this.$refs.WordCloud
                // console.log('lll');
                if (WordCloud){
                    const myChart = this.$echarts.init(WordCloud)
                    // console.log('5555');
                    const option = {
                        backgroundColor: "#fff",
                        series: [
                            {
                                type: "wordCloud",
                                gridSize: 4,
                                sizeRange: [10, 25],
                                rotationRange: [0, 0],
                                textStyle: {
                                    normal: {
                                        color: function () {
                                            return (
                                                "rgb(" +
                                                Math.round(Math.random() * 255) +
                                                ", " +
                                                Math.round(Math.random() * 255) +
                                                ", " +
                                                Math.round(Math.random() * 255) +
                                                ")"
                                            );
                                        }
                                    }
                                },
                                right: null,
                                bottom: null,
                                width: "100%",
                                height: "100%",
                                //数据
                                data: this.worddata
                            }
                        ]

                    }
                    myChart.setOption(option)
                    window.addEventListener("resize",function () {
                        myChart.resize()
                    })
                }
                // }
                // console.log('6666');
                // chart.setOption(option);
            },
            handleClose(done) {
                this.dialogVisible=false
            },
            // table
            handleClick(row) {
                // console.log("绑定查询按键");
                // console.log(row);
            },
            remove () {
                this.dataSource = this.dataSource.filter(item => this.selectedRows.findIndex(row => row.key === item.key) === -1)
                this.selectedRows = []
            },
            handleMenuClick (e) {
                if (e.key === 'delete') {
                    this.remove()
                }
            },
            //获取行内信息
            handle(row, event, column) {
                console.log("这是row")
                console.log(row)
                const that = this
                that.imageRow =row
                this.dialogVisible=true
                this.$nextTick(()=>{
                    this.initChart()
                })
                let j = 0
                for(let i in row){
                    // // console.log(i)
                    if (i!=='buyerNick'){
                        console.log(row[i])
                        this.worddata[j].name=row[i]
                        j++
                    }

                }
            },
            //省份选择
            handleChange(value) {
                // console.log(`selected ${value}`);
            },
            handleBlur() {
                // console.log('blur');
            },
            handleFocus() {
                // console.log('focus');
            },
            filterOption(input, option) {
                return (
                    option.componentOptions.children[0].text.toLowerCase().indexOf(input.toLowerCase()) >= 0
                );
            },

        }
    }
</script>

<style lang="less" scoped>

    .search{
        margin-bottom:30px;
    }
    .fold{
        width: calc(100% - 216px);
        display: inline-block
    }
    .operator{
        margin-bottom: 18px;
    }
    .biaoge{
        margin-bottom:10px;
    }
    @media screen and (max-width: 900px) {
        .fold {
            width: 100%;
        }
    }
    .demo-table-expand {
        font-size: 0;
    }
    .demo-table-expand label {
        width: 40px;
        color: #bf271f;
    }
    .demo-table-expand .el-form-item {
        margin-right: 0;
        margin-bottom: 0;
        width:100%;
    }
    .el-tag {
        margin-right: 10px;
        font-size: medium;
        /*margin-top: 0px;*/
        position: center;
    }
    .el-row {
        margin-bottom: 10px;
        &:last-child {
            margin-bottom: 0;
        }
    }
    .global-search-wrapper {
        padding-right: 50px;
        margin: 20px 0;
    }
</style>